cases/openfoam.com/fanRotationAndAMI/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh           dynamicMotionSolverFvMesh;
motionSolver            solidBody;
solidBodyMotionFunction rotatingMotion;


cellZone    rotatingZone;
origin      (0.055 0 0.051);
axis        (0 1 0);

// Function1 usage
// Ramp from 0 s to 4 s to the maximum RPM. Max RPM = 600 rotations per minute
// Omega however is in rad/s = 62.8

// We use the "table" function1.
omega       table
(
    (0      0)
    (4      62.8)
    (100    62.8)
);

// The scale function1 does not work with v2112
// Using "scale" we have to tell FOAM the value we want to scale and how the
// value should be scaled. Hence, scale below is the function and value
// is the value we want to scale. Both are again function1 which lead to 
// the possibility for high complexe functions
/*scale
{
    type        linearRamp;         // Function1 -> linearRamp
    start       0;
    duration    4;
}

// The value we want to scale
value
{
    type            constant;       // Function1 -> constant
    value           62.8;
}
*/


// ************************************************************************* //
